import re

ME_WORDS = ['من', 'خودم', 'بنده', 'اینجانب',
            'اساین به من', 'اساین به خودم', 'اساین به بنده', 'اساین به اینجانب',
            'تخصیص به من', 'تخصیص به خودم', 'تخصیص به بنده', 'تخصیص به اینجانب',
            'مال من', 'مال خودم', 'مال بنده', 'مال اینجانب',
            'مربوط به من', 'مربوط به خودم', 'مربوط به بنده', 'مربوط به اینجانب', ]

UNASSIGNED_WORDS = ['رو هوا', 'مال هیچ کس', 'مال هیچکس', 'مال هیچکی', 'مال هیشکی',
                    'بدون تخصیص', 'بدون‌تخصیص', 'بی تخصیص', 'بی‌تخصیص',
                    'بی صاحب', 'بی‌صاحب', 'بدون صاحب', 'بدون‌صاحب',
                    'بی مسئول', 'بی‌مسئول', 'بدون مسئول', 'بدون‌مسئول',
                    'بی انجام دهنده', 'بی‌انجام دهنده', 'بدون انجام دهنده', 'بدون‌انجام دهنده',
                    'بی انجام‌دهنده', 'بی‌انجام‌دهنده', 'بدون انجام‌دهنده', 'بدون‌انجام‌دهنده', ]

GROUP_WORDS = ['گروه', 'این گروه', 'گروپ', 'این گروپ', 'مکالمه', 'این مکالمه',
               'اعضا', 'کاربران', 'همه', 'اینجا', 'همینجا', ]

WORKSPACE_WORDS = ['فضا', 'فضای کاری', 'فضای‌کاری', 'ورک اسپیس', 'ورک‌‌اسپیس', 'تیم', ]

HELP_WORDS = ['کمک', 'چیه', 'چی هست', 'هلپ', 'help', 'معرفی', 'آشنایی', 'توضیح', 'چیست', 'چی کار', 'چیکار', '؟', '\?',
              'کارت چیه', 'کارش چیه', ]

LIST_COMMAND = re.compile(
    r'^\s*/کارساز\s+'
    r'(?:(?:لیست|فهرست|مجموعه|جدول|اطلاعات)\s+)?'
    r'(?:(?:همه|همه‌ی|همه ی|تمام|کل)\s+)?'
    r'(?:لیست|فهرست|مجموعه|موارد|اساین|اساینی|اساین شده|اساین شده به|مسئول|تخصیص|تخصیص یافته|تخصیص یافته به|تودو|تو دو|کارهای|کارای|کار های|کارها|کار ها|کار|تسکهای|تسکای|تسک های|تسکها|تسک ها|تسک)'
    r'(?:\s+(?:باز|تودو|تو دو|انجام نشده|دان نشده|نیازمند اقدام|نیازمند بررسی|نیازمند توجه|منتظر|منتظر اقدام|منتظر بررسی|منتظر توجه))?'
    r'(?:\s+(' + '|'.join(ME_WORDS) + '|' + '|'.join(UNASSIGNED_WORDS) + '|' + '|'.join(
        GROUP_WORDS) + '|@\S+)(?:\s+(?:(?:در|تو|توی|داخل|درون)\s+)?(' + '|'.join(WORKSPACE_WORDS) + '))?)?(?:\s+.*)?'
)

HELP_COMMAND = re.compile(
    r'^\s*/کارساز\s+'
    r'(?:' + '|'.join(HELP_WORDS) + ')'
)

HELP_COMMAND_IN_PV = re.compile(
    r'^\s*/(?:' + '|'.join(HELP_WORDS) + ')'
)

DONE_TASK_TEMPLATE = '/کارساز اتمام {}'
DONE_TASK_COMMAND = re.compile(r'^\s*/کارساز\s+اتمام\s+(\S+)')

DELETE_TASK_TEMPLATE = '/کارساز حذف {}'
DELETE_TASK_COMMAND = re.compile(r'^\s*/کارساز\s+حذف\s+(\S+)')


TASK_TAG_PATTERN = re.compile(r'(?<!\w)(#Task|#Assigned|#کار)(?!\w)', re.IGNORECASE)

DONE_TAG_PATTERN = re.compile(r'(?<!\w)(#Done|#Done_and_Approved)(?!\w)', re.IGNORECASE)

MENTION_USERNAME_PATTERN = re.compile(r'@(\S+)')


SENDING_MSG_SIZE_LIMIT = 5000

EMPTY_ASSIGNEE = ':heavy_multiplication_x:مشخص نشده:heavy_multiplication_x:'
