from limoo import LimooDriver
from utils import send_msg_in_thread


async def handle_help_message(ld: LimooDriver, event):
    help_message = (
        'بات کارساز یه ابزار مدیریت کار (Task Management) هست.\n  \n'
        '**ساخت کار:** شما میتونید با زدن یکی از برچسب‌های `#کار`، `#Task` یا `#Assigned` روی پیامتون، '
        'از روی اون یک کار برای فردی که درون پیام منشن شده بسازید.\n'
        'اگه درون پیام چندین فرد و یا حتی بات‌ها منشن شده باشن، اولین کاربر غیر بات به عنوان «مسئول» کار مشخص میشه.\n  \n'
        '**لیست کارها:** برای مشاهده لیست کارها، میتونید از دستورات زیر (یا شبیه اون‌ها) استفاده کنید:\n'
        '[/کارساز کارهای من](/کارساز کارهای من)\n'
        '[/کارساز کارهای گروه](/کارساز کارهای گروه)\n'
        '`/کارساز کارهای @منشن_فرد`\n'
        '[/کارساز کارهای بدون مسئول](/کارساز کارهای بدون مسئول)\n'
        '[/کارساز کارهای من در فضا](/کارساز کارهای من در فضا)\n  \n'
        '**اتمام کار:** وقتی یه کار انجام شد، سازنده کار با زدن یکی از برچسب‌های `#Done` یا `#Done_and_Approved` روی پیام مربوط به کار، '
        'میتونه وضعیت اون رو به «انجام شده» تغییر بده.\n  \n'
        '**حذف کار:** برای حذف کار، سازنده کار باید برچسب `#کار`، `#Task` یا `#Assigned` رو از روی پیام مربوط به کار برداره.\n  \n'
        '#### نکات:\n'
        '- برای برچسب زدن به پیام، یا باید برچسب رو تو متن پیام تایپ کنید یا از منوی پیام گزینه «برچسب زدن» رو انتخاب کنید (برای برداشتن برچسب هم همچنین).\n'
        '- با ویرایش متن پیامِ مربوط به کار، میتونید توضیحات یا مسئول کار رو تغییر بدید.\n'
        '- با حذف پیام، کار مربوط به اون پیام هم حذف میشه.\n'
        # '- برای اتمام یا حذف کار، علاوه بر ویرایش پیام مربوط به کار، میتونید از لینک‌های عملیات درون جدول لیست کارها هم استفاده کنید.\n'  # TODO
    )

    await send_msg_in_thread(ld, help_message, event)
